# Автомат по возрасту

while True:
    user_input = input("Введите ваш возраст: ")
    try:
        age = int(user_input)
        break    # ввод успешен, выходим из цикла
    except ValueError:
        print("Ошибка: нужно ввести именно целое число. Попробуйте еще раз. ")

# Проверка на некорректный диапозон
if age < 0 or age > 150:
    print("Ошибка: возраст должен быть от 0 до 150 лет. ")
elif 0 <= age <= 12:
    print("Категория: ребенок")
elif 13 <= age <= 17:
    print("Категория: подросток")
elif 18 <= age <= 64:
    print("Категория: взрослый")
else:    # age >= 65 и при этом <= 150
    print("Категория: пенсионер")
